/****************************************Copyright (c)****************************************************
** File Name:           time_calculate.c
** Created By:          lisonchen
** Created date:        2015-09-21
** Version:             v1.00
** Descriptions:        日期时间计算
**
*********************************************************************************************************/

#include "includes.h"

u8 month[12]={31,28,31,30,31,30,31,31,30,31,30,31};

/*******************************************************************************
//功能:是否为闰年
//返回: 1 闰年 0 非闰年
*******************************************************************************/
u8 Leap_Year(u32 year)
{
         return  ((year % 400 == 0) || ((year % 4 == 0)&& (year % 100 != 0))) ? 1 : 0;
}

/*******************************************************************************
//功能: 将年转化为天
//返回: sum 转化的天数
*******************************************************************************/
 u32 Year_To_Day(u8 year_begin[], u8 year_end[])
{
         u32 sum = 0;
         u32 number_begin = 2000 + year_begin[0]*10 + year_begin[1];
         u32 number_end = 2000 + year_end[0]*10 + year_end[1];
 
         while(number_begin != number_end)
         {
                   sum = sum + 365 + Leap_Year(number_begin);
                   number_begin++;
         }
 
         return sum;
}

/*******************************************************************************
//功能:将月转化为天数
//返回:转化完成的天数
*******************************************************************************/
 u32 Month_To_Day(u8 Date[])
{
         u32 i;
         u32 year = 2000 + Date[0]*10 + Date[1];
         u32 mmonth = Date[2]*10 + Date[3];
         u32 day = Date[4]*10 + Date[5];
 
         for (i = 0; i < mmonth - 1; ++i)
         {
                   day = day + month[i];
         }
 
         return (mmonth >= 3) ? day + Leap_Year(year) :  day;
 
}

/*******************************************************************************
//功能:计算两个日期之间的差值
//参数:begin 起始日期  end 结束日期，且begin <= end
//返回:算出的时间差值
*******************************************************************************/
 u32 Calculate(u8 begin[],u8 end[])
{
         return Year_To_Day(begin, end) - Month_To_Day(begin) + Month_To_Day(end);
}
 
